#include <stdio.h>
#define N 50	//30명이상

typedef struct Client {
	char stnum[40];
	char password[40];
	char name[40];
	char address[40];
	char phnum[40];
}client;

int main()
{//학번,비밀번호,이름,주소,전화번호순
    FILE *clifp=fopen("client.txt","w+");
	client client[N] = {
		{"20180121","go6652","고진식","숭실대학교","01014640195"},
		{"20181187","go6599","고학중","숭실대학교","01051993635"},
		{"20180771","kim1917","김태동","숭실대학교","01071714356"},
		{"20187591","kim7162","김희찬","숭실대학교","01020543784"},
		{"20189747","kim9236","김흥수","숭실대학교","01098010114"},
		{"20183654","do8117","도지영","숭실대학교","01085073362"},
		{"20188906","la6983","라은호","숭실대학교","010172788814"},
		{"20187667","ma5067","마건주","숭실대학교","01070756285"},
		{"20188894","park2090","박정은","숭실대학교","01014377494"},
		{"20183514","ban6174","반정도","숭실대학교","01067209626"},
		{"20189250","seo0040","서보라","숭실대학교","01030161933"},
		{"20181043","song7994","송대휘","숭실대학교","01059994372"},
		{"20181869","an8415","안정일","숭실대학교","01068487191"},
		{"20186608","yeo2071","여승은","숭실대학교","01059349391"},
		{"20185299","oo1568","오사랑","숭실대학교","01032452418"},
		{"20188736","yoon4799","윤병구","숭실대학교","01047806283"},
		{"20187818","you9932","유빛나","숭실대학교","01082768996"},
		{"20189417","yoon9486","윤경우","숭실대학교","01062174175"},
		{"20184591","yoon8074","윤재혁","숭실대학교","01028228256"},
		{"20185217","lee5186","이명진","숭실대학교","01030664447"},
		{"20184808","jo4465","조국대","숭실대학교","01033869364"},
		{"20189462","jo9561","조은정","숭실대학교","01013224392"},
		{"20184755","choi9404","최소형","숭실대학교","01060808978"},
		{"20187992","chot1569","최현정","숭실대학교","01025919239"},
		{"20186610","han1880","한덕수","숭실대학교","01034494058"},
		{"20182792","han0498","한성연","숭실대학교","01002745239"},
		{"20181630","ham3908","함윤희","숭실대학교","01019238070"},
		{"20184657","hyun4864","현태운","숭실대학교","01074331301"},
		{"20183721","hong2096","홍남주","숭실대학교","01019292824"},
		{"20183903","hwanh7331","황영건","숭실대학교","01043164554"},
	};
    for(int i=0;i<30;i++) fprintf(clifp,"%s|%s|%s|%s|%s\n",client[i].stnum,client[i].password,client[i].name,client[i].address,client[i].phnum);
    fclose(clifp);
	return 0;
}
